daniel-widrick/esp32-aurora-gateway/sdkconfig.defaults
# Pin the target. Deleting sdkconfig silently reverts to plain esp32 and the
# build succeeds - producing an image for the wrong chip.
CONFIG_IDF_TARGET="esp32s3"

# Waveshare Industrial ESP32-S3 RS485/CAN control board.
# Console goes over the native USB-Serial-JTAG (the USB-C port that enumerates
# as VID 303A / PID 1001), not UART0 - UART0's pins aren't broken out usefully
# and UART1 is committed to RS485.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 16 MB flash. PSRAM is deliberately left OFF: the chip reports 8 MB embedded
# PSRAM, but enabling it with the wrong mode (quad vs octal) fails at boot, and
# a Modbus poller needs none of it. Turn it on later only if something needs it.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTPS API. The cert is EC P-256 rather than RSA - the TLS handshake is far
# cheaper on this chip and every client we care about supports it.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Rollback protection. A new image boots in PENDING_VERIFY; if it does not call
# esp_ota_mark_app_valid_cancel_rollback() the bootloader reverts to the
# previous slot on the next reset. This is the only safety net once the board
# is at the furnace with no USB - without it, one bad OTA is a site visit.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Make the task watchdog actually reboot instead of just printing a warning.
# Default is warn-only, which on a board with no USB means a starved or
# deadlocked task hangs forever with nobody to read the warning. This is the
# low-level backstop; supervisor.c is the application-level one.
CONFIG_ESP_TASK_WDT_PANIC=y

CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Disable 802.11n frame aggregation.
#
# The UniFi APs here (OUI 68:d7:9a) and this ESP32-S3 cannot hold a block-ack
# session together: the console showed "[ADDBA] RX DELBA, reason:39" (timeout)
# on a ~2 minute cycle, and while that was happening BROADCAST traffic worked
# (DHCP got a lease, ARP resolved) but every UNICAST packet was dropped. The
# board looked perfectly healthy - associated at -47 dBm, RS-485 polling with
# zero errors - and was completely unreachable.
#
# Measured on one AP, same board, minutes apart:
#   AMPDU on  : 0/10 HTTP, 100% ICMP loss, endless reason 2/205 disconnects
#   AMPDU off : 10/10 HTTP at 18-26 ms, 0% ICMP loss, zero disconnects, zero DELBA
#
# Costs throughput this gateway will never miss - it moves a few dozen 16-bit
# registers per poll. Removing this brings back an unreachable board.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# Compile VERBOSE log statements in so the WiFi driver blob can emit its
# block-ack (ADDBA/DELBA) logging - esp_wifi_init() takes the driver's log level
# from this symbol. The RUNTIME default level stays INFO, and wifi.c knocks the
# driver back to INFO immediately after init, so nothing is noisy by default.
# Enable on demand: POST {"wifi_debug":true} to /api/mode.
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
